---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseCurtainWallData
source: html/85c395b2-49bd-573d-8a39-8b5414f8148d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseCurtainWallData Property

Switching element type to a non-Curtain element Family type. All data about Mullions, Grid Lines, and design units for the Curtain element will be lost.

## Syntax (C#)
```csharp
public static FailureDefinitionId LooseCurtainWallData { get; }
```